import React from 'react'
import classes from './product.module.scss'
import type { IProductProps } from '../../types'

const Product = ({data}: IProductProps) => {
 
  return (
    <div className={classes.wrapper}>
            <div className={classes.favorite}>
                <svg xmlns="http://www.w3.org/2000/svg" width="16" height="14" viewBox="0 0 16 14" fill="none">
                <path d="M7.05625 13.6313L6.97813 13.5594L1.50312 8.47502C0.54375 7.58439 0 6.33439 0 5.02502V4.92189C0 2.72189 1.5625 0.834394 3.725 0.421894C4.95625 0.184394 6.21562 0.468769 7.21875 1.17502C7.5 1.37502 7.7625 1.60627 8 1.87189C8.13125 1.72189 8.27188 1.58439 8.42188 1.45627C8.5375 1.35627 8.65625 1.26252 8.78125 1.17502C9.78438 0.468769 11.0437 0.184394 12.275 0.418769C14.4375 0.831269 16 2.72189 16 4.92189V5.02502C16 6.33439 15.4563 7.58439 14.4969 8.47502L9.02188 13.5594L8.94375 13.6313C8.6875 13.8688 8.35 14.0031 8 14.0031C7.65 14.0031 7.3125 13.8719 7.05625 13.6313ZM7.47188 3.53127C7.45938 3.52189 7.45 3.50939 7.44063 3.49689L6.88438 2.87189L6.88125 2.86877C6.15937 2.05939 5.06875 1.69064 4.00625 1.89377C2.55 2.17189 1.5 3.44064 1.5 4.92189V5.02502C1.5 5.91564 1.87188 6.76877 2.525 7.37502L8 12.4594L13.475 7.37502C14.1281 6.76877 14.5 5.91564 14.5 5.02502V4.92189C14.5 3.44377 13.45 2.17189 11.9969 1.89377C10.9344 1.69064 9.84062 2.06252 9.12187 2.86877C9.12187 2.86877 9.12187 2.86877 9.11875 2.87189C9.11562 2.87502 9.11875 2.87189 9.11563 2.87502L8.55937 3.50002C8.55 3.51252 8.5375 3.52189 8.52812 3.53439C8.3875 3.67502 8.19687 3.75314 8 3.75314C7.80312 3.75314 7.6125 3.67502 7.47188 3.53439V3.53127Z" fill="#4B5563"/>
                </svg>
            </div>
        <div className={classes.container}>
            <div className={classes.image}>
                <img src="" alt="Картинок пока нет : (" />
            </div>
            <div className={classes.info}>
                <h4 className={classes.title}>{data.name}</h4>
                <div className={classes.priceContainer}>
                    <span>{data.price} ₽ / шт</span> 
                    <button className={classes.card}>В корзину</button>
                </div>           
            </div>
        </div>
    </div>
  )
}

export default Product