
import classes from './style.module.scss'
import cover from '../../assets/Копия e6543243-f46f-4242-a861-594b08ce2c37.png'
import left from '../../assets/ленина.jpg'
import right from '../../assets/Краснооктярьская.jpg'
import useWindowDimensions from '../../hook'
const Contacts = () => {
    const {width} = useWindowDimensions();
    return (
    <div className={classes.wrapper}>  
        <section className={classes.cover}>
            <h1 className={classes.title}>Контакты</h1>
                <p className={classes.subTitle}>
                    Свяжитесь с нами удобным для вас способом. Мы готовы ответить на все ваши вопросы, помочь с выбором и принять заказ.
                </p>
        </section>
        <main className={classes.container}>
            <section className={classes.main}>
                <div className={classes.imageContainer}>
                    <img decoding="async" loading="lazy" src={cover} alt="" />
                </div>
                <div className={classes.description}>
                    <div className={classes.addressContainer}>
                        <svg xmlns="http://www.w3.org/2000/svg" width="14" height="20" viewBox="0 0 14 20" fill="none">
                            <path d="M7 9.5C6.33696 9.5 5.70107 9.23661 5.23223 8.76777C4.76339 8.29893 4.5 7.66304 4.5 7C4.5 6.33696 4.76339 5.70107 5.23223 5.23223C5.70107 4.76339 6.33696 4.5 7 4.5C7.66304 4.5 8.29893 4.76339 8.76777 5.23223C9.23661 5.70107 9.5 6.33696 9.5 7C9.5 7.3283 9.43534 7.65339 9.3097 7.95671C9.18406 8.26002 8.99991 8.53562 8.76777 8.76777C8.53562 8.99991 8.26002 9.18406 7.95671 9.3097C7.65339 9.43534 7.3283 9.5 7 9.5ZM7 0C5.14348 0 3.36301 0.737498 2.05025 2.05025C0.737498 3.36301 0 5.14348 0 7C0 12.25 7 20 7 20C7 20 14 12.25 14 7C14 5.14348 13.2625 3.36301 11.9497 2.05025C10.637 0.737498 8.85652 0 7 0Z" fill="#000000b0"/>
                        </svg>
                        <p className={classes.addressContainer}><a style={{color: '#000', textDecoration: 'none'}} href="https://2gis.ru/biysk/branches/70000001055064561/firm/70000001055064562/85.175304%2C52.529585?m=85.175304%2C52.529585%2F15.7">Петра Мерлина улица, 51в к1</a></p>
                    </div>
                    <div className={classes.phoneContainer}>
                        <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" viewBox="0 0 16 16" fill="none">
                            <path fillRule="evenodd" clipRule="evenodd" d="M1.88547 0.51017C2.06045 0.335459 2.27055 0.199929 2.50187 0.11256C2.73318 0.025192 2.98043 -0.012019 3.22721 0.00339321C3.47399 0.0188054 3.71469 0.0864889 3.93333 0.201958C4.15198 0.317428 4.34359 0.478046 4.49547 0.67317L6.29047 2.97917C6.61947 3.40217 6.73547 3.95317 6.60547 4.47317L6.05847 6.66317C6.03039 6.77661 6.03201 6.89537 6.06319 7.008C6.09437 7.12063 6.15405 7.22332 6.23647 7.30617L8.69347 9.76317C8.77642 9.84576 8.87928 9.90554 8.9921 9.93672C9.10492 9.9679 9.22388 9.96944 9.33747 9.94117L11.5265 9.39417C11.7831 9.33038 12.0509 9.32558 12.3096 9.38014C12.5684 9.4347 12.8114 9.54719 13.0205 9.70917L15.3265 11.5032C16.1555 12.1482 16.2315 13.3732 15.4895 14.1142L14.4555 15.1482C13.7155 15.8882 12.6095 16.2132 11.5785 15.8502C8.93914 14.9228 6.54301 13.4119 4.56847 11.4302C2.58684 9.45592 1.07602 7.06014 0.148471 4.42117C-0.213529 3.39117 0.111471 2.28417 0.851471 1.54417L1.88547 0.51017Z" fill="#000000b0"/>
                        </svg>
                        <p className={classes.phone}>+7‒962‒803‒39‒04</p>
                    </div>
                    <div className={classes.timeContainer}>
                        <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
                            <path d="M10 19C14.9706 19 19 14.9706 19 10C19 5.02944 14.9706 1 10 1C5.02944 1 1 5.02944 1 10C1 14.9706 5.02944 19 10 19Z" stroke="#000000b0" strokeWidth="2"/>
                            <path d="M14.5 10H10.25C10.1837 10 10.1201 9.97366 10.0732 9.92678C10.0263 9.87989 10 9.8163 10 9.75V6.5" stroke="#000000b0" strokeWidth="2" strokeLinecap="round"/>
                        </svg>
                        <p className={classes.time}>Круглосуточно</p>
                    </div>
                </div>
            </section>
            
            <section className={width < 700 ? classes.main : classes.right}>
                <div className={classes.imageContainer}>
                    <img decoding="async" loading="lazy" src={left} alt="" />
                </div>
                <div className={classes.description}>
                    <div className={classes.addressContainer}>
                        <svg xmlns="http://www.w3.org/2000/svg" width="14" height="20" viewBox="0 0 14 20" fill="none">
                            <path d="M7 9.5C6.33696 9.5 5.70107 9.23661 5.23223 8.76777C4.76339 8.29893 4.5 7.66304 4.5 7C4.5 6.33696 4.76339 5.70107 5.23223 5.23223C5.70107 4.76339 6.33696 4.5 7 4.5C7.66304 4.5 8.29893 4.76339 8.76777 5.23223C9.23661 5.70107 9.5 6.33696 9.5 7C9.5 7.3283 9.43534 7.65339 9.3097 7.95671C9.18406 8.26002 8.99991 8.53562 8.76777 8.76777C8.53562 8.99991 8.26002 9.18406 7.95671 9.3097C7.65339 9.43534 7.3283 9.5 7 9.5ZM7 0C5.14348 0 3.36301 0.737498 2.05025 2.05025C0.737498 3.36301 0 5.14348 0 7C0 12.25 7 20 7 20C7 20 14 12.25 14 7C14 5.14348 13.2625 3.36301 11.9497 2.05025C10.637 0.737498 8.85652 0 7 0Z" fill="#000000b0"/>
                        </svg>
                        <p className={classes.addressContainer}>​Владимира Ленина улица, 260 к1</p>
                    </div>
                    <div className={classes.phoneContainer}>
                        <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" viewBox="0 0 16 16" fill="none">
                            <path fillRule="evenodd" clipRule="evenodd" d="M1.88547 0.51017C2.06045 0.335459 2.27055 0.199929 2.50187 0.11256C2.73318 0.025192 2.98043 -0.012019 3.22721 0.00339321C3.47399 0.0188054 3.71469 0.0864889 3.93333 0.201958C4.15198 0.317428 4.34359 0.478046 4.49547 0.67317L6.29047 2.97917C6.61947 3.40217 6.73547 3.95317 6.60547 4.47317L6.05847 6.66317C6.03039 6.77661 6.03201 6.89537 6.06319 7.008C6.09437 7.12063 6.15405 7.22332 6.23647 7.30617L8.69347 9.76317C8.77642 9.84576 8.87928 9.90554 8.9921 9.93672C9.10492 9.9679 9.22388 9.96944 9.33747 9.94117L11.5265 9.39417C11.7831 9.33038 12.0509 9.32558 12.3096 9.38014C12.5684 9.4347 12.8114 9.54719 13.0205 9.70917L15.3265 11.5032C16.1555 12.1482 16.2315 13.3732 15.4895 14.1142L14.4555 15.1482C13.7155 15.8882 12.6095 16.2132 11.5785 15.8502C8.93914 14.9228 6.54301 13.4119 4.56847 11.4302C2.58684 9.45592 1.07602 7.06014 0.148471 4.42117C-0.213529 3.39117 0.111471 2.28417 0.851471 1.54417L1.88547 0.51017Z" fill="#000000b0"/>
                        </svg>
                        <p className={classes.phone}>+7‒960‒945‒04‒25</p>
                    </div>
                    <div className={classes.timeContainer}>
                        <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
                            <path d="M10 19C14.9706 19 19 14.9706 19 10C19 5.02944 14.9706 1 10 1C5.02944 1 1 5.02944 1 10C1 14.9706 5.02944 19 10 19Z" stroke="#000000b0" strokeWidth="2"/>
                            <path d="M14.5 10H10.25C10.1837 10 10.1201 9.97366 10.0732 9.92678C10.0263 9.87989 10 9.8163 10 9.75V6.5" stroke="#000000b0" strokeWidth="2" strokeLinecap="round"/>
                        </svg>
                        <p className={classes.time}>Круглосуточно</p>
                    </div>
                </div>
            </section>
            <section className={width < 700 ? classes.main : classes.left}>
                                <div className={classes.imageContainer}>
                    <img decoding="async" loading="lazy" src={right} alt="" />
                </div>
                <div className={classes.description}>
                    <div className={classes.addressContainer}>
                        <svg xmlns="http://www.w3.org/2000/svg" width="14" height="20" viewBox="0 0 14 20" fill="none">
                            <path d="M7 9.5C6.33696 9.5 5.70107 9.23661 5.23223 8.76777C4.76339 8.29893 4.5 7.66304 4.5 7C4.5 6.33696 4.76339 5.70107 5.23223 5.23223C5.70107 4.76339 6.33696 4.5 7 4.5C7.66304 4.5 8.29893 4.76339 8.76777 5.23223C9.23661 5.70107 9.5 6.33696 9.5 7C9.5 7.3283 9.43534 7.65339 9.3097 7.95671C9.18406 8.26002 8.99991 8.53562 8.76777 8.76777C8.53562 8.99991 8.26002 9.18406 7.95671 9.3097C7.65339 9.43534 7.3283 9.5 7 9.5ZM7 0C5.14348 0 3.36301 0.737498 2.05025 2.05025C0.737498 3.36301 0 5.14348 0 7C0 12.25 7 20 7 20C7 20 14 12.25 14 7C14 5.14348 13.2625 3.36301 11.9497 2.05025C10.637 0.737498 8.85652 0 7 0Z" fill="#000000b0"/>
                        </svg>
                        <p className={classes.addressContainer}>Краснооктябрьская улица, 93 к1</p>
                    </div>
                    <div className={classes.phoneContainer}>
                        <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" viewBox="0 0 16 16" fill="none">
                            <path fillRule="evenodd" clipRule="evenodd" d="M1.88547 0.51017C2.06045 0.335459 2.27055 0.199929 2.50187 0.11256C2.73318 0.025192 2.98043 -0.012019 3.22721 0.00339321C3.47399 0.0188054 3.71469 0.0864889 3.93333 0.201958C4.15198 0.317428 4.34359 0.478046 4.49547 0.67317L6.29047 2.97917C6.61947 3.40217 6.73547 3.95317 6.60547 4.47317L6.05847 6.66317C6.03039 6.77661 6.03201 6.89537 6.06319 7.008C6.09437 7.12063 6.15405 7.22332 6.23647 7.30617L8.69347 9.76317C8.77642 9.84576 8.87928 9.90554 8.9921 9.93672C9.10492 9.9679 9.22388 9.96944 9.33747 9.94117L11.5265 9.39417C11.7831 9.33038 12.0509 9.32558 12.3096 9.38014C12.5684 9.4347 12.8114 9.54719 13.0205 9.70917L15.3265 11.5032C16.1555 12.1482 16.2315 13.3732 15.4895 14.1142L14.4555 15.1482C13.7155 15.8882 12.6095 16.2132 11.5785 15.8502C8.93914 14.9228 6.54301 13.4119 4.56847 11.4302C2.58684 9.45592 1.07602 7.06014 0.148471 4.42117C-0.213529 3.39117 0.111471 2.28417 0.851471 1.54417L1.88547 0.51017Z" fill="#000000b0"/>
                        </svg>
                        <p className={classes.phone}>+7‒913‒098‒58‒02</p>
                    </div>
                    <div className={classes.timeContainer}>
                        <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
                            <path d="M10 19C14.9706 19 19 14.9706 19 10C19 5.02944 14.9706 1 10 1C5.02944 1 1 5.02944 1 10C1 14.9706 5.02944 19 10 19Z" stroke="#000000b0" strokeWidth="2"/>
                            <path d="M14.5 10H10.25C10.1837 10 10.1201 9.97366 10.0732 9.92678C10.0263 9.87989 10 9.8163 10 9.75V6.5" stroke="#000000b0" strokeWidth="2" strokeLinecap="round"/>
                        </svg>
                        <p className={classes.time}>Круглосуточно</p>
                    </div>
                </div>
            </section>
        </main>
    </div>
  )
}

export default Contacts